{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "CNN_Structural_Phishing_URL",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                250
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "seq_input",
              "optional": false,
              "batchInputShape": [
                null,
                250
              ]
            },
            "name": "seq_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "input_dim": 101,
              "output_dim": 64,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": {
                  "seed": null,
                  "minval": -0.05,
                  "maxval": 0.05
                },
                "registered_name": null
              },
              "embeddings_constraint": null,
              "mask_zero": false,
              "quantization_config": null
            },
            "name": "embedding",
            "inbound_nodes": [
              [
                [
                  "seq_input",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "rate": 0.2,
              "seed": null,
              "name": "spatial_dropout",
              "dtype": "float32"
            },
            "name": "spatial_dropout",
            "inbound_nodes": [
              [
                [
                  "embedding",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "cnn_conv1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "cnn_conv1",
            "inbound_nodes": [
              [
                [
                  "spatial_dropout",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "cnn_bn1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "cnn_bn1",
            "inbound_nodes": [
              [
                [
                  "cnn_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "cnn_pool1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2
              ],
              "padding": "valid",
              "strides": [
                2
              ],
              "data_format": "channels_last"
            },
            "name": "cnn_pool1",
            "inbound_nodes": [
              [
                [
                  "cnn_bn1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                32
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "structural_input",
              "optional": false,
              "batchInputShape": [
                null,
                32
              ]
            },
            "name": "structural_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "cnn_conv2",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 256,
              "kernel_size": [
                3
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "cnn_conv2",
            "inbound_nodes": [
              [
                [
                  "cnn_pool1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "struct_dense1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "struct_dense1",
            "inbound_nodes": [
              [
                [
                  "structural_input",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "cnn_bn2",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "cnn_bn2",
            "inbound_nodes": [
              [
                [
                  "cnn_conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "struct_bn1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "struct_bn1",
            "inbound_nodes": [
              [
                [
                  "struct_dense1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "GlobalMaxPooling1D",
            "config": {
              "name": "seq_global_max",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "seq_global_max",
            "inbound_nodes": [
              [
                [
                  "cnn_bn2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "seq_global_avg",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "seq_global_avg",
            "inbound_nodes": [
              [
                [
                  "cnn_bn2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "struct_dropout1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.2,
              "seed": null,
              "noise_shape": null
            },
            "name": "struct_dropout1",
            "inbound_nodes": [
              [
                [
                  "struct_bn1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "seq_features",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1
            },
            "name": "seq_features",
            "inbound_nodes": [
              [
                [
                  "seq_global_max",
                  0,
                  0,
                  {}
                ],
                [
                  "seq_global_avg",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "struct_features",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 32,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "struct_features",
            "inbound_nodes": [
              [
                [
                  "struct_dropout1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "fusion_concat",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1
            },
            "name": "fusion_concat",
            "inbound_nodes": [
              [
                [
                  "seq_features",
                  0,
                  0,
                  {}
                ],
                [
                  "struct_features",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "head_dense1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "head_dense1",
            "inbound_nodes": [
              [
                [
                  "fusion_concat",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "head_bn1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "head_bn1",
            "inbound_nodes": [
              [
                [
                  "head_dense1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "head_dropout1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "rate": 0.3,
              "seed": null,
              "noise_shape": null
            },
            "name": "head_dropout1",
            "inbound_nodes": [
              [
                [
                  "head_bn1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "main_output",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "main_output",
            "inbound_nodes": [
              [
                [
                  "head_dropout1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "aux_output",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "aux_output",
            "inbound_nodes": [
              [
                [
                  "struct_features",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "seq_input",
            0,
            0
          ],
          [
            "structural_input",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "main_output",
            0,
            0
          ],
          [
            "aux_output",
            0,
            0
          ]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "aux_output/kernel",
          "shape": [
            32,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "aux_output/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_bn1/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_bn1/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_bn1/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_bn1/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_bn2/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_bn2/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_bn2/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_bn2/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_conv1/kernel",
          "shape": [
            5,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_conv1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_conv2/kernel",
          "shape": [
            3,
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "cnn_conv2/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "embedding/embeddings",
          "shape": [
            101,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "head_bn1/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "head_bn1/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "head_bn1/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "head_bn1/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "head_dense1/kernel",
          "shape": [
            544,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "head_dense1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "main_output/kernel",
          "shape": [
            128,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "main_output/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "struct_bn1/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "struct_bn1/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "struct_bn1/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "struct_bn1/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "struct_dense1/kernel",
          "shape": [
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "struct_dense1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "struct_features/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "struct_features/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}