{
  "format": "layers-model",
  "generatedBy": "keras v3.13.2",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.13.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "Wide_Deep_Gated_Fusion",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [
                null,
                250
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "seq_input",
              "optional": false,
              "batchInputShape": [
                null,
                250
              ]
            },
            "name": "seq_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "input_dim": 101,
              "output_dim": 64,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": {
                  "seed": null,
                  "minval": -0.05,
                  "maxval": 0.05
                },
                "registered_name": null
              },
              "embeddings_constraint": null,
              "mask_zero": false,
              "quantization_config": null
            },
            "name": "embedding",
            "inbound_nodes": [
              [
                [
                  "seq_input",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "SpatialDropout1D",
            "config": {
              "rate": 0.2,
              "seed": null,
              "name": "spatial_dropout1d",
              "dtype": "float32"
            },
            "name": "spatial_dropout1d",
            "inbound_nodes": [
              [
                [
                  "embedding",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [
                9
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d",
            "inbound_nodes": [
              [
                [
                  "spatial_dropout1d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization",
            "inbound_nodes": [
              [
                [
                  "conv1d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation",
            "inbound_nodes": [
              [
                [
                  "batch_normalization",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [
                9
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_1",
            "inbound_nodes": [
              [
                [
                  "activation",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [
              [
                [
                  "conv1d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling1d",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 8,
              "activation": "relu",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense",
            "inbound_nodes": [
              [
                [
                  "global_average_pooling1d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 32,
              "activation": "sigmoid",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              [
                [
                  "dense",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "target_shape": [
                1,
                32
              ]
            },
            "name": "reshape",
            "inbound_nodes": [
              [
                [
                  "dense_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_2",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 32,
              "kernel_size": [
                1
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_2",
            "inbound_nodes": [
              [
                [
                  "spatial_dropout1d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Multiply",
            "config": {
              "name": "multiply",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              }
            },
            "name": "multiply",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_1",
                  0,
                  0,
                  {}
                ],
                [
                  "reshape",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [
              [
                [
                  "conv1d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              }
            },
            "name": "add",
            "inbound_nodes": [
              [
                [
                  "multiply",
                  0,
                  0,
                  {}
                ],
                [
                  "batch_normalization_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation_1",
            "inbound_nodes": [
              [
                [
                  "add",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2
              ],
              "padding": "valid",
              "strides": [
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling1d",
            "inbound_nodes": [
              [
                [
                  "activation_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_3",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [
                7
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_3",
            "inbound_nodes": [
              [
                [
                  "max_pooling1d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_3",
            "inbound_nodes": [
              [
                [
                  "conv1d_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_2",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation_2",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_4",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [
                7
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_4",
            "inbound_nodes": [
              [
                [
                  "activation_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_4",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_4",
            "inbound_nodes": [
              [
                [
                  "conv1d_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling1d_1",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 8,
              "activation": "relu",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense_2",
            "inbound_nodes": [
              [
                [
                  "global_average_pooling1d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 64,
              "activation": "sigmoid",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense_3",
            "inbound_nodes": [
              [
                [
                  "dense_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "reshape_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "target_shape": [
                1,
                64
              ]
            },
            "name": "reshape_1",
            "inbound_nodes": [
              [
                [
                  "dense_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_5",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 64,
              "kernel_size": [
                1
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_5",
            "inbound_nodes": [
              [
                [
                  "max_pooling1d",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Multiply",
            "config": {
              "name": "multiply_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              }
            },
            "name": "multiply_1",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_4",
                  0,
                  0,
                  {}
                ],
                [
                  "reshape_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_5",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_5",
            "inbound_nodes": [
              [
                [
                  "conv1d_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "add_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              }
            },
            "name": "add_1",
            "inbound_nodes": [
              [
                [
                  "multiply_1",
                  0,
                  0,
                  {}
                ],
                [
                  "batch_normalization_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_3",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation_3",
            "inbound_nodes": [
              [
                [
                  "add_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_1",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "pool_size": [
                2
              ],
              "padding": "valid",
              "strides": [
                2
              ],
              "data_format": "channels_last"
            },
            "name": "max_pooling1d_1",
            "inbound_nodes": [
              [
                [
                  "activation_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_6",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_6",
            "inbound_nodes": [
              [
                [
                  "max_pooling1d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_6",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_6",
            "inbound_nodes": [
              [
                [
                  "conv1d_6",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "activation_4",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "activation": "relu"
            },
            "name": "activation_4",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_6",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_7",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "filters": 128,
              "kernel_size": [
                5
              ],
              "strides": [
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "HeNormal",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1d_7",
            "inbound_nodes": [
              [
                [
                  "activation_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_7",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_constraint": null,
              "gamma_constraint": null,
              "synchronized": false
            },
            "name": "batch_normalization_7",
            "inbound_nodes": [
              [
                [
                  "conv1d_7",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_2",
              "trainable": false,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "data_format": "channels_last",
              "keepdims": false
            },
            "name": "global_average_pooling1d_2",
            "inbound_nodes": [
              [
                [
                  "batch_normalization_7",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 8,
              "activation": "relu",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
              "quantization_config": null
            },
            "name": "dense_4",
            "inbound_nodes": [
              [
                [
                  "global_average_pooling1d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": {
                "module": "keras",
                "class_name": "DTypePolicy",
                "config": {
                  "name": "float32"
                },
                "registered_name": null
              },
              "units": 128,
              "activation": "sigmoid",
              "use_bias": false,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_constraint": null,
              "bias_constraint": null,
